# NDashM Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..NDashM Property
SymbolTypeId Class See Also
---
Symbol N-m, indicating unit Newton meters.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId NDashM { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NDashM As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ NDashM {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace